#include<stdio.h>
int main()
{
    int num = 0;
    scanf("%d", &num);
    int count = 0;
    int i = 0;
    for (i = 1; i <= num; i++)
    {
        //七的倍数：i%7==0
        //最高位是7，那么往后所有数都与7有关，全部需要计算：i/1000==7||i/100==7||i/10==7
        //从最高位往下找7：i%10000/1000==7||i%1000/100==7||i%100/10==7||i%10==7
        if (i % 7 == 0 || i / 1000 == 7 || i / 100 == 7 || i / 10 == 7 || i % 10000 / 1000 == 7 || i % 1000 / 100 == 7 || i % 100 / 10 == 7 || i % 10 == 7)
        {


            count++;
        }
    }
    printf("%d\n", count);
    return 0;
}